In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("cm_data.csv")

In [3]:
df

    Age Name  contact
0  20.0  zyz    123.0
1  30.0  NaN    234.0
2   NaN  NaN      NaN
3  40.0  NaN      NaN

In [4]:
df.dropna(axis=0)

    Age Name  contact
0  20.0  zyz    123.0

In [5]:
df.dropna(axis=0,thresh = 1) ### print rows which have atleast 1 value

    Age Name  contact
0  20.0  zyz    123.0
1  30.0  NaN    234.0
3  40.0  NaN      NaN

In [6]:
df.dropna(axis=0,thresh = 2) ## get me those rows which have atleast 2 values

    Age Name  contact
0  20.0  zyz    123.0
1  30.0  NaN    234.0

In [7]:
df.dropna(axis=0,thresh = 3)

    Age Name  contact
0  20.0  zyz    123.0